БПКР/src/DataProcessors/СопостовлениеОбъектовСервисов/СопостовлениеОбъектовСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СопостовлениеОбъектовСервисов</name>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>EnumRef.ИменаСервисов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСправочника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеЗагрузкиТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовараЭТТН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>CatalogRef.КлассификаторТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭДСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеЗагрузкиТранспортныеСредства</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>МаркаТранспорта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТранспорта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеЗагрузкиСклады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеСкладаВИСЭТТН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактичесикйАдресСклада</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресСкладаВИСЭТТН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеЗагрузкиСкладыКонтрагентов</name>
    <attributes>
      <name>СкладКонтрагента</name>
      <type>
        <types>CatalogRef.СкладыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеСкладаВИСЭТТН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактичесикйАдресСклада</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресСкладаВИСЭТТН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеЗагрузкиВодители</name>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.Водители</types>
      </type>
    </attributes>
    <attributes>
      <name>ФИОВодителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИННВодителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

БПКР/src/DataProcessors/СопостовлениеОбъектовСервисов/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

 // СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла 
 
 // Устанавливает параметры загрузки.
//
//@skip-warning
Процедура УстановитьПараметрыЗагрузкиИзФайлаВТЧ(Параметры) Экспорт
	
КонецПроцедуры

// Производит сопоставление данных, загружаемых в табличную часть ПолноеИмяТабличнойЧасти,
// с данными в ИБ, и заполняет параметры АдресТаблицыСопоставления и СписокНеоднозначностей.
//
// Параметры:
//   АдресЗагружаемыхДанных    - Строка - Адрес временного хранилища с таблицей значений, в которой
//                                        находятся загруженные данные из файла. Состав колонок:
//     * Идентификатор - Число - Порядковый номер строки;
//     * остальные колонки соответствуют колонкам макета ЗагрузкаИзФайла.
//   АдресТаблицыСопоставления - Строка - Адрес временного хранилища с пустой таблицей значений,
//                                        являющейся копией табличной части документа, 
//                                        которую необходимо заполнить из таблицы АдресЗагружаемыхДанных.
//   СписокНеоднозначностей - ТаблицаЗначений - Список неоднозначных значений, для которых в ИБ имеется несколько
//                                              подходящих вариантов.
//     * Колонка       - Строка - Имя колонки, в которой была обнаружена неоднозначность;
//     * Идентификатор - Число  - Идентификатор строки, в которой была обнаружена неоднозначность.
//   ПолноеИмяТабличнойЧасти   - Строка - Полное имя табличной части, в которую загружаются данные.
//   ДополнительныеПараметры   - ЛюбойТип - Любые дополнительные сведения.
//
Процедура СопоставитьЗагружаемыеДанные(АдресЗагружаемыхДанных, АдресТаблицыСопоставления, СписокНеоднозначностей, ПолноеИмяТабличнойЧасти, ДополнительныеПараметры) Экспорт
	
	ДанныеЗагрузки = ПолучитьИзВременногоХранилища(АдресТаблицыСопоставления);
	ЗагружаемыеДанные = ПолучитьИзВременногоХранилища(АдресЗагружаемыхДанных);
	
	Для Каждого СтрокаТаблицы Из ЗагружаемыеДанные Цикл
		
		СтрокаТабличнойЧасти = ДанныеЗагрузки.Добавить();
		
		Если ДополнительныеПараметры.ВидСправочника = "Товары" Тогда
			СтрокаТабличнойЧасти.ИдентификаторОбъекта 		= СтрокаТаблицы.ИдентификаторОбъекта;
			СтрокаТабличнойЧасти.НаименованиеТовараЭТТН		= СтрокаТаблицы.Наименование;
			СтрокаТабличнойЧасти.КодТНВЭДСтрокой 			= СтрокаТаблицы.КодТНВЭД;
			СтрокаТабличнойЧасти.Штрихкод 					= СтрокаТаблицы.Штрихкод;
			
		ИначеЕсли ДополнительныеПараметры.ВидСправочника = "Склады"
			ИЛИ ДополнительныеПараметры.ВидСправочника = "Склады контрагентов" Тогда
			СтрокаТабличнойЧасти.ИдентификаторОбъекта 		= СтрокаТаблицы.ИдентификаторОбъекта;
			СтрокаТабличнойЧасти.НаименованиеСкладаВИСЭТТН 	= СтрокаТаблицы.Наименование;
			СтрокаТабличнойЧасти.АдресСкладаВИСЭТТН 		= СтрокаТаблицы.Адрес;
			
		ИначеЕсли ДополнительныеПараметры.ВидСправочника = "Транспортные средства" Тогда
			СтрокаТабличнойЧасти.ИдентификаторОбъекта 		= СтрокаТаблицы.ИдентификаторОбъекта;
			СтрокаТабличнойЧасти.МаркаТранспорта 			= СтрокаТаблицы.МаркаТранспорта;
			СтрокаТабличнойЧасти.НомерТранспорта 			= СтрокаТаблицы.НомерТранспорта;
			
		ИначеЕсли ДополнительныеПараметры.ВидСправочника = "Водители" Тогда
			СтрокаТабличнойЧасти.ИдентификаторОбъекта 		= СтрокаТаблицы.ИдентификаторОбъекта;
			СтрокаТабличнойЧасти.ФИОВодителя 				= СтрокаТаблицы.ФИОВодителя;
			СтрокаТабличнойЧасти.ИННВодителя 				= СтрокаТаблицы.ИННВодителя;	
		КонецЕсли;	
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ДанныеЗагрузки, АдресТаблицыСопоставления);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла
 
#КонецОбласти
